Tekla Open API Reference for Tekla Structures 2025
MaterialSelectionForm Class
 The MaterialSelectionForm class represents a dialog to select materials using the material catalogs.
Inheritance Hierarchy
System.Object
 System.MarshalByRefObject
 System.ComponentModel.Component
 System.Windows.Forms.Control
 System.Windows.Forms.ScrollableControl
 System.Windows.Forms.ContainerControl
 System.Windows.Forms.Form
 Tekla.Structures.Dialog.UIControls.MaterialSelectionForm
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public class MaterialSelectionForm : Form
Public Class MaterialSelectionForm
	Inherits Form
The MaterialSelectionForm type exposes the following members.
Constructors
Name | Description
MaterialSelectionForm(List<MaterialItem>)
 Creates a new instance of the MaterialSelectionForm.
MaterialSelectionForm(List<MaterialItem>, String)
 Creates a new instance of the MaterialSelectionForm, selecting the given material in the tree control.
Top
Properties
Name | Description
SelectedMaterial
 The selected material in the control.
Top
See Also
Reference
Tekla.Structures.Dialog.UIControls Namespace